# Напишите программу, которая найдёт произведение пар чисел списка. 
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

n = int(input("Введите количество элементов списка: "))
count = 0
array = []
while count < n:
    array.append(int(input(f"Введите элемент на позиции {count}: ")))
    count += 1
for i in range(0, n // 2 + n % 2):
    print(array[i]*array[- i - 1])